#include<stdio.h>

int main()
{

        /*
        * y:121 --------> bin -> 1111001
        * e:101 --------> bin ->          1100101
        * s:115 --------> bin ->                   1110011
        * yes:7955827 --> bin -> 1111001 01100101 01110011
        **/

        printf("y:%d\n",'y');
        printf("e:%d\n",'e');
        printf("s:%d\n",'s');
        printf("yes_d:%d\n",'yes');
        //printf("yes_s:%s\n",'yes'); //会崩溃
                                      //个人理解： 因为单引号，引起来的，实际上是个数字. 
                                      //而%s是当作指向字符串常量的指针来处理的，指针指向了一个不存在的地址,导致崩溃

        return 0;
}
